ELPasEDT/src/InformationRegisters/РаботаХимцеха/РаботаХимцеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботаХимцеха</name>
  <comment>(УР)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Включено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Концентрация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>Вахта</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.ВидыЗаписейЖурналаУчетаРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/РаботаХимцеха/ManagerModule.bsl
Функция ПолучитьАктуальнуюЗаписьОборудования(Оборудование, ВидЗаписи, Период = '00010101') Экспорт
	
	СостояниеОборудования = Новый Структура;
	
	СостояниеОборудования.Вставить("Период", '00010101');
	СостояниеОборудования.Вставить("Уровень", 0);
	СостояниеОборудования.Вставить("Концентрация", 0);
	СостояниеОборудования.Вставить("ВремяРаботы", 0);
	СостояниеОборудования.Вставить("ВидРеагента", Неопределено);
	СостояниеОборудования.Вставить("Подразделение", Неопределено);
	СостояниеОборудования.Вставить("Включено", Ложь);
	СостояниеОборудования.Вставить("Регистратор", Неопределено);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РаботаХимцехаСрезПоследних.Период КАК Период,
	|	РаботаХимцехаСрезПоследних.Уровень КАК Уровень,
	|	РаботаХимцехаСрезПоследних.Концентрация КАК Концентрация,
	|	РаботаХимцехаСрезПоследних.ВремяРаботы КАК ВремяРаботы,
	|	РаботаХимцехаСрезПоследних.ВидРеагента КАК ВидРеагента,
	|	РаботаХимцехаСрезПоследних.Подразделение КАК Подразделение,
	|	РаботаХимцехаСрезПоследних.Включено КАК Включено,
	|	РаботаХимцехаСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.РаботаХимцеха.СрезПоследних(
	|			&Период,
	|			Оборудование = &Оборудование
	|				И ВидЗаписи = &ВидЗаписи) КАК РаботаХимцехаСрезПоследних");
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("ВидЗаписи",    ВидЗаписи);
	Запрос.УстановитьПараметр("Период",       Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат СостояниеОборудования;
	
КонецФункции
